# Removing columns from a pandas DataFrame

In [1]:
import pandas as pd

In [2]:
# Creating pandas DataFrame
url='http://bit.ly/uforeports'

ufo = pd.read_csv(url)

In [3]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [4]:
ufo.shape

(18241, 5)

In [5]:
# Drop  single column by name
# axis = 0 row axis , is the default, so technically, we can leave this out.
# axis = 1 column axis
# inplace = True    In order to remove columns on the existing DataFrame object use inplace=True param
ufo.drop('Colors Reported', axis=1, inplace = True)

In [7]:
ufo.head()

                   City Shape Reported State             Time
0                Ithaca       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro          OTHER    NJ  6/30/1930 20:00
2               Holyoke           OVAL    CO  2/15/1931 14:00
3               Abilene           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair          LIGHT    NY  4/18/1933 19:00

In [8]:
# Drop columns from list of columns
lisCol=['City','State']
ufo.drop(lisCol, axis=1, inplace=True)

In [9]:
ufo.head()

  Shape Reported             Time
0       TRIANGLE   6/1/1930 22:00
1          OTHER  6/30/1930 20:00
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00

In [10]:
# Drop rows 0 and 1
# axis=0 is the default, so technically, you can leave this out
rows =[0,1]
ufo.drop(rows, axis=0, inplace=True)

In [11]:
ufo.head()

  Shape Reported             Time
2           OVAL  2/15/1931 14:00
3           DISK   6/1/1931 13:00
4          LIGHT  4/18/1933 19:00
5           DISK  9/15/1934 15:30
6         CIRCLE   6/15/1935 0:00

Reference:

[Pandas Drop Columns from DataFrame](https://sparkbyexamples.com/pandas/pandas-drop-columns-examples/)